Autodesk.Revit.DB.FailureMessageAccessor.ShouldMergeWithMessage(Autodesk.Revit.DB.FailureMessageAccessor)
Checks if the FailureMessage should be merged with the other FailureMessage for better user experience.
Remarks:
Messages should be merged if all user-visible information except failing elements is the same,
failure resolution types are the same and merging lists of failing elements keeps message text applicable to all of them equally.
Method is used by the Revit UI to display multiple messages as one.
Returns:
True if messages should be merged
Throws Autodesk.Revit.Exceptions.ArgumentException:
messageToMergeWith has not been properly initialized.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessageAccessor has not been properly initialized.
Since:
2011